*** ols-dock-activate
   #+begin_src emacs-lisp
     (defun ols-dock-activate (target)
       (org-ls-do "dock-activate" :target target))

     ;; (ols-dock-activate "Google Chrome")
   #+end_src

   #+name: dock-activate
   #+begin_src apples :result silent :var target="Google Chrome"
     tell application target to activate
     tell application "System Events"
          click UI element target of list 1 of application process "Dock"
     end tell
   #+end_src

   #+RESULTS: dock-activate
   : UI element Google Chrome of list 1 of application process Dock

